# ------------------------------------------
# Preamble - Custom options and settings
# ------------------------------------------


# This should not be altered
# ------------------------------------------
#+OPTIONS: H:4 num:t toc:nil title:nil ^:{}
#+OPTIONS: TeX:t LaTeX:t
# ------------------------------------------

#+TITLE: The No-nonsense document for org latex reference

#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{tikzmark}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage[dvipsnames]{xcolor}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{siunitx}
#+LATEX_HEADER: \usepackage{lipsum}
#+LATEX_HEADER: \usepackage{lmodern}
#+LATEX_HEADER: \usepackage[skins,many,breakable]{tcolorbox}
#+LATEX_HEADER: \tcbuselibrary{theorems}
#+LATEX_HEADER: \newcounter{savedeq}

# TCOLORBOX VARIATIONS

#+LATEX_HEADER: \newtcolorbox{exercise_box}[1][Non Mutually Exclusive Events]{
#+LATEX_HEADER:     skin=widget,
#+LATEX_HEADER:     boxrule=1mm,
#+LATEX_HEADER:     coltitle=black,
#+LATEX_HEADER:     colframe=blue!45!white,
#+LATEX_HEADER:     colback=blue!15!white,
#+LATEX_HEADER:     title=#1}

#+LATEX_HEADER: \newtcolorbox[auto counter]{derivation}{%
#+LATEX_HEADER:   code=\setcounter{savedeq}{\value{equation}}%
#+LATEX_HEADER:     \setcounter{equation}{0}\renewcommand{\theequation}{\thetcbcounter-\arabic{equation}},%
#+LATEX_HEADER:   after=\setcounter{equation}{\value{savedeq}},%
#+LATEX_HEADER:   ams align,%
#+LATEX_HEADER:   title={DERIVATION \thetcbcounter},%
#+LATEX_HEADER:   fonttitle=\bfseries,%
#+LATEX_HEADER:   label={derivation@\thetcbcounter},
#+LATEX_HEADER:   coltitle=black,%
#+LATEX_HEADER:   colback=orange!25,%
#+LATEX_HEADER:   colframe=orange!60,%
#+LATEX_HEADER:   %colback=orange!5!white,%
#+LATEX_HEADER:   %colframe=orange!75!black%
#+LATEX_HEADER: }%
#+LATEX_HEADER: %\numberwithin{equation}{derivation}

# new tcolorbox environment
# #1: tcolorbox options
# #2: color
# #3: box title
** Pretty Inline Symbolic Mathematics in Org-Mode
A babel literate code  example using the python's =SymPy= computing some common calculus
equations producing inline LaTeX output:

#+BEGIN_SRC python :session
from sympy import *

def inline(s):
    return "\[" + s + "\]\n"
#+END_SRC

#+BEGIN_SRC python :session :results replace raw
x = symbols("x")
functions = [
    x*2,
    ln(x),
    ln(x)**2,
    csc(x),
    sin(x**2),
    atan(x),
    x**x,
    2**x,
    exp(x**2)
]
display = lambda f: inline(latex(Integral(f, x)) + " = " + latex(integrate(f)) + " + c")
"\n".join(map(display, functions))
#+END_SRC

#+RESULTS:
\[\int 2 x\, dx = x^{2} + c\]

\[\int \log{\left(x \right)}\, dx = x \log{\left(x \right)} - x + c\]

\[\int \log{\left(x \right)}^{2}\, dx = x \log{\left(x \right)}^{2} - 2 x \log{\left(x \right)} + 2 x + c\]

\[\int \csc{\left(x \right)}\, dx = \frac{\log{\left(\cos{\left(x \right)} - 1 \right)}}{2} - \frac{\log{\left(\cos{\left(x \right)} + 1 \right)}}{2} + c\]

\[\int \sin{\left(x^{2} \right)}\, dx = \frac{3 \sqrt{2} \sqrt{\pi} S\left(\frac{\sqrt{2} x}{\sqrt{\pi}}\right) \Gamma\left(\frac{3}{4}\right)}{8 \Gamma\left(\frac{7}{4}\right)} + c\]

\[\int \operatorname{atan}{\left(x \right)}\, dx = x \operatorname{atan}{\left(x \right)} - \frac{\log{\left(x^{2} + 1 \right)}}{2} + c\]

\[\int x^{x}\, dx = \int x^{x}\, dx + c\]

\[\int e^{x^{2}}\, dx = \frac{\sqrt{\pi} \operatorname{erfi}{\left(x \right)}}{2} + c\]
\[\int 2 x\, dx = x^{2} + c\]

\[\int \log{\left(x \right)}\, dx = x \log{\left(x \right)} - x + c\]

\[\int \csc{\left(x \right)}\, dx = \frac{\log{\left(\cos{\left(x \right)} - 1 \right)}}{2} - \frac{\log{\left(\cos{\left(x \right)} + 1 \right)}}{2} + c\]

\[\int \operatorname{atan}{\left(x \right)}\, dx = x \operatorname{atan}{\left(x \right)} - \frac{\log{\left(x^{2} + 1 \right)}}{2} + c\]

\[\int e^{x^{2}}\, dx = \frac{\sqrt{\pi} \operatorname{erfi}{\left(x \right)}}{2} + c\]


** Creating and exporting tables
You can create an empty table using C-c | to run the command
org-table-create-or-convert-from-region, which will prompt for table
dimensions if no region is selected.

The same command can easily convert some text to a table; select the
following text and use C-c | to run the command
org-table-create-or-convert-from-region again to convert the text to a
table

 ID  x   y
 A   2   4
 B   3   9
 C   4  16
 D   5  25

You can also save tables to their own files by putting the cursor in
the table and using M-x org-table-export. You'll be asked for a
file name and a format. For the format, type orgtbl-to and press TAB
to see the available options (e.g. orgtbl-to-csv will convert to csv
in the output file).


#+name: this-is-the-table
| 1 | 4 | 7 |
| 2 | 5 | 8 |
| 3 | 6 | 9 |

#+name: this-is-the-table
#+begin_src emacs-lisp :var table=this-is-the-table :exports both
  (mapcar (lambda (row) (mapcar (lambda (cell) (* cell 2)) row)) table)
#+end_src

#+RESULTS: this-is-the-table
| 2 |  8 | 14 |
| 4 | 10 | 16 |
| 6 | 12 | 18 |

